import pandas as pd
import re

class File: # Створення батьківського класу File
    def __init__(self, file_path, header=False, dtype=str, encoding="utf-8"):
    """ Конструктор __init__ - метод об'єкта File. self — це посилання на конкретний "екземпляр" (копію) об'єкта, який щойно створили, self дозволяє методам всередині класу "спілкуватися" між собою. Без self дані, отримані в __init__, "загинули" б одразу після виходу з цієї функції.
    self.file_path: Зберігає шлях до файлу.
    self.header: Логічне значення (True/False), яке підказує, чи є в першому рядку заголовки колонок.
    self.dtype: Встановлює очікуваний тип даних (за замовчуванням str). Це розумно, бо при роботі з текстом/словниками краще мати дані у форматі рядків, ніж несподівано отримати числа. Тут нічого ще не конвертується, це просто інструкція.
    self.data = None: Це "місце під дані". Залишаємо його порожнім, бо дані ще не завантажені. Це дуже правильний підхід: спочатку налаштовуємо об'єкт, потім завантажуємо дані. "Ліниве завантаження" (lazy loading). Ми економимо пам'ять ПК, не забиваючи її даними в ту саму секунду, коли створили об'єкт.
    self.encoding: Дуже важлива річ для кирилиці! Встановлення "utf-8" за замовчуванням рятує від помилок "UnicodeDecodeError", які часто виникають, коли програма не може прочитати українські літери. """
        self.header = header # Чи є заголовки в Excel/CSV
        self.dtype = dtype
        self.file_path = file_path
        self.data = None
        self.encoding = encoding # Захист від помилок читання кирилиці (utf-8)
        """ Процес ініціалізації атрибутів. Якщо прибрати self, то змінна file_path, header, dtype, encoding будуть локальними. Вона "помруть" без self як тільки функція __init__ завершить свою роботу. """

class ExcelFile(File): # Клас ExcelFile тепер успадковує клас File (шлях, кодування, тип даних), але при цьому має свою унікальну властивість — читати саме Excel-файли
    def load_data (self, cols=None): 
    """ В ООП self — це "сполучна ланка". Оскільки load_data — це метод класу, він повинен мати доступ до даних, які ми зберегли раніше в конструкторі __init__. Без self метод load_data не знав би, який саме файл відкривати. Він каже: "Візьми self.file_path, який ми записали в паспорт цього об'єкта раніше". None - робить аргумент необов'язковим, Якщо викличемо load_data(), завантажаться всі колонки. """
        with pd.ExcelFile(self.file_path) as reader: # Створює зв'язок із файлом на диску. Як тільки код всередині блоку with закінчиться, Python автоматично "відпустить" файл.
            self.data = pd.read_excel(reader, usecols=cols, dtype=self.dtype, sheet_name='БАЗА').fillna('')
            """ Метод .fillna('') - коли в Excel є порожня клітинка, Pandas записує туди спеціальне значення NaN (Not a Number), через це не можна зробити .split() або .lower() для NaN — програма "впаде" з помилкою. .fillna('') знаходить усі порожнечі та замінює їх на порожній рядок (текст без символів). Тепер цикли працюватимуть стабільно.""" 
""" self.data - ми записуємо всю оброблену таблицю в "пам'ять" нашого об'єкта. Тепер у будь-якому іншому місці програми можна звернутися до self.data """
        print(f"Excel-базу завантажено з файлу {self.file_path}")


class CSVFile(File): # клас для роботи з CSV-файлами
    def load_as_dict (self, key_col=0, val_col=1):
    """ key_col=0: Перша колонка (індекс 0) стане ключами (наприклад, слова мовою оригіналу), val_col=1: Друга колонка (індекс 1) стане значеннями (переклад). """
        df_dict = pd.read_csv( # Читання через pd.read_csv
            self.file_path, encoding=self.encoding, dtype=self.dtype, header=None,
            #encoding=self.encoding: Використовує "utf-8", щоб правильно прочитати кирилицю.
			#dtype=self.dtype: Читає все як текст (str).
			#header=None: Вказуємо, що у вашому CSV-словнику немає рядка з назвами колонок, дані починаються прямо з першого рядка.
        )
        return dict(zip(df_dict[key_col], df_dict[val_col])) # відразу перетворює таблицю на Python-словник


def main(): # основна функція з якої відбувається запуск програми
    base = ExcelFile("(closed) base_19.03.2026.xlsx") # Створюємо екземпляр класу ExcelFile
    cols_to_use = [3, 4, 5, 6, 7, 14, 18, 22, 23, 24, 25, 26, 27, 31, 32, 33, 37, 38] # завантажуємо лише 18 колонок замість 40+
    base.load_data(cols=cols_to_use) # звертаємось до об'єкта base і викликаємо функцію load_data
    # cols=cols_to_use - передаємо всередину методу свій заздалегідь підготований список номерів колонок, викортистання іменованого аргументу
    # Усередині методу спрацьовує self.data = pd.read_excel(...)
    dictionary_tool = CSVFile("(RUS-UKR) Большой русско-украинский словарь.csv", encoding="utf-8") # Створюємо екземляр класу CSVFile
    """ encoding="utf-8" - явне краще за неявне (Zen of Python) """
    fast_dict = dictionary_tool.load_as_dict() # викликаємо метод load_as_dict()
    # Всередині методу Pandas зчитує ваш "Большой словарь" як тимчасову таблицю. Оскільки ви вказали header=None, він сприймає перший рядок як дані, а не як назви колонок. Zip - програма бере дві колонки, "зшиває" їх попарно. Виходить набір пар: (слово, переклад)
    # Ці пари перетворюються на структуру Dictionary (Hash-map)
    # Підсумок - Коли пізніше треба знайти переклад слова, ПК не доведеться переглядати весь словник з початку до кінця. Він миттєво "стрибає" до потрібного слова за його хеш-кодом.
    num_of_cols = len(base.data.columns) # «лічильник ширини» таблиці, який потрібен для того, щоб програма знала, скільки разів їй потрібно «крокувати» вправо в кожному рядку

    all_words = [] # створюємо cписок (кошик), куди можна скидати все підряд
    unique_word = set() # створюємо множину. Вона автоматично видаляє дублікати. Якщо слово "Процесор" зустрінеться 100 разів, у сеті воно залишиться лише в одному екземплярі.
    for index, row in base.data.iterrows(): # Цикл перебирає таблицю рядок за рядком.
        for i in range(num_of_cols): # Всередині кожного рядка програма заходить у кожну клітинку з тих стовпців, що ми вибрали.
            cell_value = str(row.iloc[i]).strip()
            # row - беремо весь вміст поточного рядка та звертаємося до конкретного стовпця за його індексом в поточному рядку.
            # Функція str() примусово каже: «Мені байдуже, що там було, тепер це рядок (текст)». Наприклад, число 123 стає текстом "123"
            # .strip() видаляє всі пробіли, символи табуляції та переноси рядків на початку та в кінці слова.
            if not cell_value or cell_value.lower() == 'nan':
                continue
            # Пропускаємо порожні клітинки.
            elif not re.search(r'[a-zA-Zа-яА-ЯёЁіІїЇєЄ]', cell_value):
                continue
            # Пропускаємо клітинки, де немає жодної літери (наприклад, там лише цифри 12345 або знаки +++).
            words_in_cell = cell_value.split() # Розбиваємо поточну комірку на окремі слова за пробілами.

            for word in words_in_cell:
                if len(word) <= 3:
                    continue # Викидаємо короткі слова (сполучники, прийменники типу "і", "на", "в").
                clean_word = word.strip('.,!?;:"()') # Видаляємо знаки пунктуації навколо слова.
                if any(c.isalpha() for c in clean_word): # чи залишилися в "очищеному" слові літери (на випадок, якщо слово складалося лише зі знаків)
                    print(clean_word)
                    unique_word.add(clean_word) # Додаємо 'чисте' слово в наш набір унікальних слів (в список)
    print(len(unique_word))


if __name__ == '__main__': main()
