import pandas as pd

class File: # Створення батьківського класу File
    def __init__(self, file_path, header=False, dtype=str, encoding="utf-8"):
    """ Конструктор __init__ - метод об'єкта File. self — це посилання на конкретний "екземпляр" (копію) об'єкта, який щойно створили, self дозволяє методам всередині класу "спілкуватися" між собою. Без self дані, отримані в __init__, "загинули" б одразу після виходу з цієї функції.
    self.file_path: Зберігає шлях до файлу.
    self.header: Логічне значення (True/False), яке підказує, чи є в першому рядку заголовки колонок.
    self.dtype: Встановлює очікуваний тип даних (за замовчуванням str). Це розумно, бо при роботі з текстом/словниками краще мати дані у форматі рядків, ніж несподівано отримати числа. Тут нічого ще не конвертується, це просто інструкція.
    self.data = None: Це "місце під дані". Залишаємо його порожнім, бо дані ще не завантажені. Це дуже правильний підхід: спочатку налаштовуємо об'єкт, потім завантажуємо дані. "Ліниве завантаження" (lazy loading). Ми економимо пам'ять ПК, не забиваючи її даними в ту саму секунду, коли створили об'єкт.
    self.encoding: Дуже важлива річ для кирилиці! Встановлення "utf-8" за замовчуванням рятує від помилок "UnicodeDecodeError", які часто виникають, коли програма не може прочитати українські літери. """
        self.header = header # Чи є заголовки в Excel/CSV
        self.dtype = dtype
        self.file_path = file_path
        self.data = None
        self.encoding = encoding # Захист від помилок читання кирилиці (utf-8)
        """ Процес ініціалізації атрибутів. Якщо прибрати self, то змінна file_path, header, dtype, encoding будуть локальними. Вона "помруть" без self як тільки функція __init__ завершить свою роботу. """

class ExcelFile(File): # Клас ExcelFile тепер успадковує клас File (шлях, кодування, тип даних), але при цьому має свою унікальну властивість — читати саме Excel-файли
    def load_data (self, cols=None): 
    """ В ООП self — це "сполучна ланка". Оскільки load_data — це метод класу, він повинен мати доступ до даних, які ми зберегли раніше в конструкторі __init__. Без self метод load_data не знав би, який саме файл відкривати. Він каже: "Візьми self.file_path, який ми записали в паспорт цього об'єкта раніше". None - робить аргумент необов'язковим, Якщо викличемо load_data(), завантажаться всі колонки. """
        with pd.ExcelFile(self.file_path) as reader: # Створює зв'язок із файлом на диску. Як тільки код всередині блоку with закінчиться, Python автоматично "відпустить" файл.
            self.data = pd.read_excel(reader, usecols=cols, dtype=self.dtype, sheet_name='БАЗА').fillna('')
            """ Метод .fillna('') - коли в Excel є порожня клітинка, Pandas записує туди спеціальне значення NaN (Not a Number), через це не можна зробити .split() або .lower() для NaN — програма "впаде" з помилкою. .fillna('') знаходить усі порожнечі та замінює їх на порожній рядок (текст без символів). Тепер цикли працюватимуть стабільно.""" 
""" self.data - ми записуємо всю оброблену таблицю в "пам'ять" нашого об'єкта. Тепер у будь-якому іншому місці програми можна звернутися до self.data """
        print(f"Excel-базу завантажено з файлу {self.file_path}")


class CSVFile(File): # клас для роботи з CSV-файлами
    def load_as_dict (self, key_col=0, val_col=1):
    """ key_col=0: Перша колонка (індекс 0) стане ключами (наприклад, слова мовою оригіналу), val_col=1: Друга колонка (індекс 1) стане значеннями (переклад). """
        df_dict = pd.read_csv( # Читання через pd.read_csv
            self.file_path, encoding=self.encoding, dtype=self.dtype, header=None,
            #encoding=self.encoding: Використовує "utf-8", щоб правильно прочитати кирилицю.
			#dtype=self.dtype: Читає все як текст (str).
			#header=None: Вказуємо, що у вашому CSV-словнику немає рядка з назвами колонок, дані починаються прямо з першого рядка.
        )
        return dict(zip(df_dict[key_col], df_dict[val_col])) # відразу перетворює таблицю на Python-словник