import re

from classes import ExcelFile, CSVFile # імпорт класів


def main(): # основна функція з якої відбувається запуск програми
    base = ExcelFile("(closed) base_19.03.2026.xlsx") # Створюємо екземпляр класу ExcelFile
    cols_to_use = [3, 4, 5, 6, 7, 14, 18, 22, 23, 24, 25, 26, 27, 31, 32, 33, 37, 38] # завантажуємо лише 18 колонок замість 40+
    base.load_data(cols=cols_to_use) # звертаємось до об'єкта base і викликаємо функцію load_data
    # cols=cols_to_use - передаємо всередину методу свій заздалегідь підготований список номерів колонок, викортистання іменованого аргументу
    # Усередині методу спрацьовує self.data = pd.read_excel(...)
    dictionary_tool = CSVFile("(RUS-UKR) Большой русско-украинский словарь.csv", encoding="utf-8") # Створюємо екземляр класу CSVFile
    """ encoding="utf-8" - явне краще за неявне (Zen of Python) """
    fast_dict = dictionary_tool.load_as_dict() # викликаємо метод load_as_dict()
    # Всередині методу Pandas зчитує ваш "Большой словарь" як тимчасову таблицю. Оскільки ви вказали header=None, він сприймає перший рядок як дані, а не як назви колонок. Zip - програма бере дві колонки, "зшиває" їх попарно. Виходить набір пар: (слово, переклад)
    # Ці пари перетворюються на структуру Dictionary (Hash-map)
    # Підсумок - Коли пізніше треба знайти переклад слова, ПК не доведеться переглядати весь словник з початку до кінця. Він миттєво "стрибає" до потрібного слова за його хеш-кодом.
    num_of_cols = len(base.data.columns) # «лічильник ширини» таблиці, який потрібен для того, щоб програма знала, скільки разів їй потрібно «крокувати» вправо в кожному рядку

    all_words = [] # створюємо cписок (кошик), куди можна скидати все підряд
    unique_word = set() # створюємо множину. Вона автоматично видаляє дублікати. Якщо слово "Процесор" зустрінеться 100 разів, у сеті воно залишиться лише в одному екземплярі.
    for index, row in base.data.iterrows(): # Цикл перебирає таблицю рядок за рядком.
        for i in range(num_of_cols): # Всередині кожного рядка програма заходить у кожну клітинку з тих стовпців, що ми вибрали.
            cell_value = str(row.iloc[i]).strip()
            # row - беремо весь вміст поточного рядка та звертаємося до конкретного стовпця за його індексом в поточному рядку.
            # Функція str() примусово каже: «Мені байдуже, що там було, тепер це рядок (текст)». Наприклад, число 123 стає текстом "123"
            # .strip() видаляє всі пробіли, символи табуляції та переноси рядків на початку та в кінці слова.
            if not cell_value or cell_value.lower() == 'nan':
                continue
            # Пропускаємо порожні клітинки.
            elif not re.search(r'[a-zA-Zа-яА-ЯёЁіІїЇєЄ]', cell_value):
                continue
            # Пропускаємо клітинки, де немає жодної літери (наприклад, там лише цифри 12345 або знаки +++).
            words_in_cell = cell_value.split() # Розбиваємо поточну комірку на окремі слова за пробілами.

            for word in words_in_cell:
                if len(word) <= 3:
                    continue # Викидаємо короткі слова (сполучники, прийменники типу "і", "на", "в").
                clean_word = word.strip('.,!?;:"()') # Видаляємо знаки пунктуації навколо слова.
                if any(c.isalpha() for c in clean_word): # чи залишилися в "очищеному" слові літери (на випадок, якщо слово складалося лише зі знаків)
                    print(clean_word)
                    unique_word.add(clean_word) # Додаємо 'чисте' слово в наш набір унікальних слів (в список)
    print(len(unique_word))


if __name__ == '__main__': main()
